const TERMS = {
    PRIVACY_POLICY: `
      개인정보 수집 및 약관

      개인정보보호법에 따라 나비잠에 회원가입 신청하시는 분께 수집하는 개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보유 및 이용기간, 동의 거부권 및 동의 거부 시 불이익에 관한 사항을 안내 드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.
  
      1. 수집하는 개인정보
      회원가입 시점에 나비잠이 이용자로부터 수집하는 개인정보는 아래와 같습니다.
  
      회원 가입 시 필수항목
      - 아이디(이메일), 비밀번호
      - 소셜 로그인 시 추가 동의 후 아이디와 비밀번호를 수집.
  
      서비스 이용 과정에서 이용자로부터 수집하는 개인정보는 아래와 같습니다:
      - 회원정보 또는 개별 서비스에서 프로필 정보(이름, 프로필 사진)를 설정할 수 있습니다.
      - 회원정보에 별명을 입력하지 않은 경우, 마스킹 처리된 아이디가 별명으로 자동 입력됩니다.
      - 서비스 이용 과정에서 생성되는 이용 기록 및 챗봇 대화 기록이 수집될 수 있습니다.
      - 이용자 기기의 고유한 정보를 원래 값을 확인하지 못하도록 안전하게 변환하여 수집합니다.
  
      2. 수집한 개인정보의 이용
      나비잠 서비스의 회원관리, 서비스 개발 및 향상, 안전한 모바일 이용환경 구축 등 아래의 목적으로만 개인정보를 이용합니다:
      - 회원 가입 의사 확인, 이용자 식별, 회원탈퇴 의사 확인 등 회원관리를 위해 이용.
      - 콘텐츠 및 서비스 제공, 방문 및 이용 기록의 분석, 신규 서비스 발굴 및 개선을 위해 이용.
      - 챗봇 대화 기록, 감정 측정 기록 등에서 AI 기술 적용.
      - 서비스 이용 통계 및 개인 맞춤형 대시보드 구성.
      - 이용자의 안전한 서비스 환경 구축을 위해 이용.
  
      3. 개인정보의 보관기간
      기본 원칙:
      - 이용자의 개인정보는 회원 탈퇴 시 즉시 파기합니다.
  
      예외 상황:
      - 나비잠 서비스를 위한 개인정보(이메일, 비밀번호)는 수집 시점부터 1년간 보관됩니다.
  
      4. 개인정보 수집 및 이용 동의를 거부할 권리
        - 이용자는 개인정보의 수집 및 이용 동의를 거부할 권리가 있습니다.
        - 회원가입 시 필수 항목에 대한 동의를 거부할 경우, 회원가입이 어려울 수 있습니다.
    `,
    SERVICE_TERMS: `
      이용약관
  
      여러분을 환영합니다.
      
      나비잠 애플리케이션은(이하 ‘나비잠’)를 이용해 주셔서 감사합니다. 본 약관은 나비잠의 이용과 관련하여 나비잠 서비스를 제공하는 나비잠 팀과 이를 이용하는 나비잠 회원(이하 ‘회원’)과의 관계를 설명합니다.
      나비잠 서비스를 이용하시거나 나비잠 회원으로 가입하실 경우 여러분은 본 약관 및 관련 운영 정책을 확인하거나 동의하게 되므로, 잠시 시간을 내시어 주의 깊게 살펴봐 주시기 바랍니다.
  
      아이의 감정을 파악하여 육아의 불안감을 해소하십시오.
      나비잠은 언어적 표현이 불가한 유아의 감정을 유아의 목소리를 통해 파악하여 부부 분들의 육아를 돕기 위해 만들어진 애플리케이션입니다.
      나비잠은 기본적으로 여러분 모두에게 동일한 내용의 서비스를 제공합니다. 다만, '청소년보호법' 등 관련 법령이나 기타 개별 서비스 제공에서의 특별한 필요에 의해서 연령 또는 일정한 등급을 기준으로 이용자를 구분하여 제공하는 서비스의 내용, 이용 시간, 이용 횟수 등을 다르게 하는 등 일부 이용을 제한하는 경우가 있습니다. 자세한 내용은 챗봇을 이용하여 쉽게 파악하실 수 있습니다.
  
      회원으로 가입하시고 나비잠 서비스를 누리세요.
      여러분은 본 약관을 읽고 동의하신 후 회원 가입을 신청하실 수 있으며, 나비잠은 이에 대한 승낙을 통해 회원 가입 절차를 완료하고 여러분께 나비잠 서비스 이용 계정(이하 ‘계정’)을 부여합니다. 계정이란 회원이 나비잠 서비스에 로그인한 이후 이용하는 각종 서비스 이용 이력을 회원 별로 관리하기 위해 설정한 회원 식별 단위를 말합니다. 회원은 자신의 계정을 통해 좀더 다양한 나비잠 서비스를 보다 편리하게 이용할 수 있습니다.
  
      여러분의 개인정보를 소중히 보호합니다.
      나비잠은 서비스의 원활한 제공을 위하여 회원이 동의한 목적과 범위 내에서만 개인정보를 수집∙이용하며, 개인정보 보호 관련 법령에 따라 안전하게 관리합니다.
      나비잠은 회원 가입 시, 아래와 같은 회원정보를 필수 항목으로 요구합니다:
      - 회원ID(이메일)
      - 비밀번호
      - 이름
      - 아이의 이름
  
      본 나비잠에서 제공하는 소셜 로그인 서비스를 이용하여 네이버, 카카오 서비스의 계정을 통해 가입을 하신 경우, 해당 서비스의 사용자 동의 과정을 거쳐 아래의 필수 항목을 수집합니다:
      - 이메일
      - 액세스 토큰 
  
      추가적으로 아래의 회원정보를 나비잠에서 필수 항목으로 요구합니다:
      - 이름
      - 아이의 이름
  
      ‘필수항목’이란 본 나버잠 서비스를 이용하기 위해 반드시 필요한 정보입니다. 이 정보는 약관 동의 이후, 1년 동안 보관하며 매년 갱신 요청이 회원께서 등록하신 이메일로 전송됩니다. 만약, 전송일로부터 한 달 이내에 갱신 요청에 불응하신 경우, 회원의 소중한 개인 정보를 위하여 부득이 관련 서비스 이용계약을 해지할 수 있습니다.
  
      나비잠 서비스 이용과 관련하여 몇 가지 주의사항이 있습니다:
      회원 가입 시 이메일은 반드시 허위로 기재하시면 안 됩니다. 이메일을 통해 개인 정보 갱신 요청이 전송 되며 이는 나비잠 서비스를 이용하는 데 필수적인 부분입니다.
    `,
  };
  
  export default TERMS;
  